# 2. Во втором массиве сохранить индексы четных элементов первого массива.
# Например, если дан массив со значениями 8, 3, 15, 6, 4, 2, то во второй
# массив надо заполнить значениями 1, 4, 5, 6 (или 0, 3, 4, 5 – если
# индексация начинается с нуля), т.к. именно в этих позициях первого массива
# стоят четные числа.

first_data = [8, 3, 15, 6, 4, 2, 10, 12, 11, 9, 14]
result = []
k = 0
for i in first_data:
    if i % 2 == 0:
        number = k
        result.append(number)
    k += 1

print(result)
